05-axiomas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 23:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Axiomas</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Axiomas</h1>
<p>
Arquivo: <code>axioms/mod.rs</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">definitions</span>;
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">predicates</span>;
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">primitives</span>;
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">bootstrap</span>;
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">mod</span> <span style="color: #569cd6;">utils</span>;

<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">definitions</span>::<span style="color: #4ec9b0;">MajRawSym</span>;
</pre>
</div>

<div id="outline-container-orgecdc29c" class="outline-2">
<h2 id="orgecdc29c"><span class="section-number-2">1.</span> Assinaturas para funções primitivas</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">gc</span>::<span style="color: #4ec9b0;">Gc</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::{ <span style="color: #4ec9b0;">MajState</span>, <span style="color: #4ec9b0;">Maj</span> };

<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">type</span> <span style="color: #4ec9b0;">MajPrimFn</span> = <span style="color: #569cd6;">fn</span>(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[macro_export]</span>
<span style="color: #c586c0;">macro_rules!</span> maj_destructure_args {
    (<span style="color: #9cdcfe;">$args</span>:expr, <span style="color: #9cdcfe;">$first</span>:ident) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$first</span>:  <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_car($args.clone());
    };

    (<span style="color: #9cdcfe;">$args</span>:expr, <span style="color: #9cdcfe;">$first</span>:ident, <span style="color: #9cdcfe;">$rest</span>:ident) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$first</span>:  <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_car($args.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$rest</span>:   <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_cdr($args.clone());
    };

    (<span style="color: #9cdcfe;">$args</span>:expr, <span style="color: #9cdcfe;">$first</span>:ident, <span style="color: #9cdcfe;">$rest</span>:ident, <span style="color: #9cdcfe;">$second</span>:ident) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$first</span>:  <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_car($args.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$rest</span>:   <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_cdr($args.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$second</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_car($rest.clone());
    };

    (<span style="color: #9cdcfe;">$args</span>:expr, <span style="color: #9cdcfe;">$first</span>:ident, <span style="color: #9cdcfe;">$rest</span>:ident, <span style="color: #9cdcfe;">$second</span>:ident,
    <span style="color: #9cdcfe;">$rest2</span>:ident) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$first</span>:  <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_car($args.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$rest</span>:   <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_cdr($args.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$second</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_car($rest.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$rest2</span>:  <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_cdr($rest.clone());
    };

    (<span style="color: #9cdcfe;">$args</span>:expr, <span style="color: #9cdcfe;">$first</span>:ident, <span style="color: #9cdcfe;">$rest</span>:ident, <span style="color: #9cdcfe;">$second</span>:ident,
     <span style="color: #9cdcfe;">$rest2</span>:ident, <span style="color: #9cdcfe;">$third</span>:ident) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$first</span>:  <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_car($args.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$rest</span>:   <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_cdr($args.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$second</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_car($rest.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$rest2</span>:  <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_cdr($rest.clone());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">$third</span>:  <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; = maj_car($rest2.clone());
    };
}
</pre>
</div>

<ul class="org-ul">
<li><code>None</code>: Nenhum argumento requerido.</li>
<li><code>Required</code>:  Número  de  argumentos obrigatórios  iguais  aos  números
informados.</li>
<li><code>Variadic</code>:   Lista  de   argumentos   encerrando-se  com   argumentos
opcionais,  de quantidade  ilimitada.  O valor  associado informa  a
quantidade de argumentos obrigatórios antes da parte variádica.</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[derive(Copy, Clone)]</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">enum</span> <span style="color: #4ec9b0;">MajPrimArgs</span> {
    <span style="color: #4ec9b0;">None</span>,
    <span style="color: #4ec9b0;">Required</span>(<span style="color: #4ec9b0;">u64</span>),
    <span style="color: #4ec9b0;">Variadic</span>(<span style="color: #4ec9b0;">u64</span>)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf11e3c8" class="outline-2">
<h2 id="orgf11e3c8"><span class="section-number-2">2.</span> Exportação de axiomas</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">definitions</span>::maj_gen_symbols;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">predicates</span>::maj_gen_predicates;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">primitives</span>::maj_gen_primitives;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">bootstrap</span>::maj_gen_bootstrap;
</pre>
</div>
</div>

<div id="outline-container-orgc57b534" class="outline-3">
<h3 id="orgc57b534"><span class="section-number-3">2.1.</span> Inicialização de contexto</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">majestic_initialize</span>(<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>) {
    maj_gen_symbols(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state);
    maj_gen_predicates(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state);
    maj_gen_primitives(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state);
    maj_gen_bootstrap(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state);
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-23 dom 23:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
